artillery results/resultadoCluster.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 500,
      "vusers.created": 500,
      "http.requests": 12500,
      "http.codes.200": 12500,
      "http.responses": 12500,
      "vusers.failed": 0,
      "vusers.completed": 500
    },
    "rates": {
      "http.request_rate": 374
    },
    "firstCounterAt": 1659663752049,
    "firstHistogramAt": 1659663752109,
    "lastCounterAt": 1659663768729,
    "lastHistogramAt": 1659663768729,
    "firstMetricAt": 1659663752049,
    "lastMetricAt": 1659663768729,
    "period": 1659663760000,
    "summaries": {
      "http.response_time": {
        "min": 1,
        "max": 152,
        "count": 12500,
        "p50": 39.3,
        "median": 39.3,
        "p75": 48.9,
        "p90": 67.4,
        "p95": 79.1,
        "p99": 102.5,
        "p999": 135.7
      },
      "vusers.session_length": {
        "min": 501.9,
        "max": 1715.6,
        "count": 500,
        "p50": 1153.1,
        "median": 1153.1,
        "p75": 1274.3,
        "p90": 1408.4,
        "p95": 1465.9,
        "p99": 1652.8,
        "p999": 1686.1
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 1,
        "max": 152,
        "count": 12500,
        "p50": 39.3,
        "median": 39.3,
        "p75": 48.9,
        "p90": 67.4,
        "p95": 79.1,
        "p99": 102.5,
        "p999": 135.7
      },
      "vusers.session_length": {
        "min": 501.9,
        "max": 1715.6,
        "count": 500,
        "p50": 1153.1,
        "median": 1153.1,
        "p75": 1274.3,
        "p90": 1408.4,
        "p95": 1465.9,
        "p99": 1652.8,
        "p999": 1686.1
      }
    }
  },
  "intermediate": []
}